import React from "react";

const warning: React.FC = () => {
    return <div>
        <h2>🐢 바거슾 질문자 유의 사항</h2>
        <ul>
            <li>1️⃣ 예/아니오로 대답할 수 있는 질문만 해주세요!</li>
            <li>2️⃣ 출제자는 상관없다는 대답도 할 수 있습니다.</li>
            <li>3️⃣ 출제자의 답변이 늦어도 재촉하지 말아주세요!</li>
            <li>4️⃣ 질문/정답 입력란에 입력 후 [질문]버튼을 눌러주세요.</li>
            <li>5️⃣ 이미 비슷한 질문이 있었는지 채팅창을 확인해주세요.</li>
            <li>6️⃣ 질문 기회는 무제한이지만, 본인이 먼저 한 질문의 답변을 받고 나서 다음 질문을 해주세요! (연속질문 X)</li>
            <li>7️⃣ 어느 정도 추리가 끝나면 질문/정답 입력란에 입력 후 [정답]을 눌러주세요.</li>
            <li>📌 혹시 처음부터 이미 답을 알고 계신다면 지켜봐 주시면 감사하겠습니다! 모르는 러븐들의 재미를 지켜주세요💚</li>
        </ul>
    </div>
}

export default warning;

