import React from "react";

const warning: React.FC = () => {
    return <div>
        <h2>🐢 바거슾 주의 사항</h2>
        <ul>
            <li>1️⃣ 예/아니오로 대답할 수 있는 질문만 해주세요!</li>
            <li>ㄴ 출제자는 상관없다는 대답도 할 수 있습니다.</li>
            <li>2️⃣ 출제자의 답변이 늦어도 재촉하지 말아주세요!</li>
            <li>3️⃣ 질문은 항상 새로운 댓글로 해주세요!</li>
            <li>ㄴ 대댓글 질문은 답변이 없을 수 있습니다.</li>
            <li>ㄴ 이미 비슷한 질답이 있었는지 확인해주세요. 같은 질문이 여러 번이면 답변이 없을 수 있습니다.</li>
            <li>4️⃣ 질문 기회는 무제한이지만, 본인이 먼저 한 질문의 답변을 받고 나서 다음 질문을 해주세요! (연속질문 X)</li>
            <li>5️⃣ 모두의 쾌적한 문제풀이를 위해, 답변이 안 달린 질문이 세 개가 넘지 않도록 유지해주세요!</li>
            <li>6️⃣ 어느 정도 추리가 끝나면 [정답!]을 외치고 그 뒤에 추리한 이야기를 제시해주세요!</li>
            <li>📌 혹시 이미 답을 알고 계신다면 지켜봐 주시면 감사하겠습니다! 모르는 러븐들의 재미를 지켜주세요💚</li>
        </ul>
    </div>
}

export default warning;

